/*9. Вывести на экран чётные числа от 1 до N
*/
int i=2;
int N=10;
while (i<=N)
{
    System.Console.WriteLine(i);
    i = i+2;
}