// 6. Написать программу вычисления значения функции y = sin(a). (Класс Math).
System.Console.Write("Введите число: ");
double x = Double.Parse(Console.ReadLine());
System.Console.WriteLine("Sin(x) = "+ Math.Sin(x));